Repository: Andre9642/nvda-markdownForever
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: es

source: No title
es: Sin título

source: No content
es: Sin contenido

source: Index of {path}
es: Índice de {path}

source: The requested URL “{path}” was not found
es: La URL solicitada “{path}” no pudo ser encontrada

source: Documentation
es: Documentación

source: Documentation menu
es: Menú documentation

source: Open the add-on documentation in this language.
es: Muestra la documentación en este idioma.

source: Settings
es: Ajustes

source: Add-on settings
es: Ajustes del complemento

source: HTTP server
es: Servidor HTTP

source: Web server
es: Servidor web

source: &Check for update
es: &Comprobar si hay actualizaciones

source: Checks if update is available
es: Comprobar si hay actualizaciones disponibles

source: &Web site
es: &Sitio web

source: Open the add-on website.
es: Muestra el sitio web del complemento.

source: No text
es: Sin texto

source: Show the HTML source from Markdown
es: Muestra la fuente HTML de un contenido Markdown

source: HTML to Markdown conversion
es: Conversión HTML hacia Markdown

source: Markdown to HTML conversion. The result is displayed in a virtual buffer of NVDA
es: Conversión Markdown hacia HTML. El resultado se muestra en un tampón virtual de NVDA

source: Markdown to HTML conversion. The result is displayed in your default browser
es: Conversión Markdown hacia HTML. El resultado se muestra en el navegador predeterminado

source: HTML source copied to clipboard
es: Fuente HTML copiado al portapapeles

source: Markdown to HTML source conversion. The result is copied to clipboard
es: Conversión Markdown en código fuente HTML. El resultado se copia al portapapeles

source: Formatted HTML copied to clipboard
es: HTML formateado copiado al portapapeles

source: An error occured
es: Se ha producido un error

source: Markdown to formatted HTML conversion. The result is copied to clipboard
es: Conversión Markdown en HTML formateado. El resultado se copia al portapapeles

source: Markdown copied to clipboard
es: Markdown copiado al portapapeles

source: HTML to Markdown conversion. The result is copied to clipboard
es: Conversión HTML en Markdown. El resultado se copia al portapapeles

source: Interactive mode
es: Modo interactivo

source: HTML source
es: Fuente HTML

source: C&onvert to:
es: C&onvertir a:

source: Generate corresponding &metadata from HTML source
es: Generar los &metadatos desde la fuente HTML

source: &Generate a table of contents
es: &Generar Tabla de Contenido / Índice

source: Try to automatically &number headings
es: Intentar de numerar automát&icamente los títulos

source: Enable e&xtra tags
es: Habilitar las &super-etiquetas

source: Allow extratags bac&k translation
es: Permitir la reversibilidad de super-&etiquetas

source: &Detect extratags if possible
es: &Detectar las super-etiquetas

source: &Title:
es: &Título:

source: S&ubtitle:
es: S&ubtítulo:

source: Pat&h:
es: Ru&ta:

source: Bro&wse...
es: Exa&minar...

source: File n&ame:
es: Nombre del &archivo:

source: HTML temp&late to use:
es: P&lantilla HTML a utilizar:

source: Corres&ponding metadata block
es: Bloque de metadatos corres&pondientes

source: Show in &virtual buffer
es: Mostrar en el tampón &virtual

source: Show in &browser
es: Mostrar en el &navegador

source: &Copy to clipboard
es: &Copiar al portapapeles

source: &Save the result as...
es: &Guardar el resultado como...

source: Save the sou&rce as...
es: Guarda&r la fuente como...

source: Choose a folder
es: Elija una carpeta

source: Select the location
es: Seleccione la ubicación

source: Do you want to conserve extra-tags? If you select No, extra-tags will be interpreted before saving.
es: ¿Te gustaría mantener las super-etiquetas? Si seleccionas No, las super-etiquetas serán interpretadas antes de ser guardadas.

source: Save the result as
es: Guardar el resultado como

source: Save the source as
es: Guardar la fuente como

source: Show in browser
es: Mostrar en el navegador

source: Show in virtual buffer
es: Mostrar en el tampón virtual

source: Copy to clipboard
es: Copiar al portapapeles

source: Turn HTML into equivalent Markdown-structured text
es: Conversión de HTML en su equivalente en texto Markdown estructurado

source: Conservatively convert html to markdown
es: Conversión sin pérdida de HTML hacia Markdown

source: Replace single new line characters with <br> when True
es: Reemplaza solo caracteres en nueva línea con <br> cuando está True

source: Disable _ and __ for em and strong
es: Deshabilitar _ y __ para em y strong

source: Allow lists to be cuddled to the preceding paragraph
es: Permitir que las listas sean enlazadas con el párrafo anterior

source: Allows a code block to not have to be indented by fencing it with '```' on a line before and after
es: Permitir que un bloque de código no tenga que tener una sangría por una delimitación con '```' en una línea antes y después

source: Support footnotes as in use on daringfireball.net and implemented in other Markdown processors (tho not in Markdown.pl v1.0.1)
es: Soporte de notas al pie como se usa en daringfireball.net e implementados en otros procesadores Markdown (aunque no en Markdown.pl v1.0.1)

source: Adds "id" attributes to headers. The id value is a slug of the header text
es: Añadir atributos "id" en los títulos. El valor del id es parte del texto contenido en el título

source: Takes a dict mapping html tag names (lowercase) to a string to use for a "class" tag attribute. Currently only supports "pre", "code", "table" and "img" tags
es: Toma un diccionario de mapeo de los nombres de las etiquetas html (en minúsculas) en una cadena que se utilizará para una etiqueta de atributo "class". Actualmente, sólo se soporta las etiquetas "pre", "code", "table" y "img"

source: Auto-link given regex patterns in text (e.g. bug number references, revision number references)
es: Auto-link en los patrones de expresiones regulares dadas en el contenido del texto (por ejemplo, bug number references, revision number references)

source: Allow the use of markdown="1" in a block HTML tag to have markdown processing be done on its contents
es: Permitir el uso de markdown="1" en un bloque para el manejo de las etiquetas HTML para tener el procesamiento en markdown ejecutado sobre su contenido

source: Add rel="nofollow" to all <a> tags with an href.
es: Añadir rel="nofollow" a todas las etiquetas <a> con un href.

source: Create counters to number tables, figures, equations and graphs
es: Crear un contador para la numeración de las tablas, imágenes, fórmulas y gráficos

source: Treats unindented Python interactive shell sessions as <code> blocks
es: Se usa para tratar sin sangría en las sesiones del intérprete interactivo de Python como los bloques <code>

source: Fancy quote, em-dash and ellipsis handling
es: Se usa para el manejo de una cita favorita, un guión largo y los puntos suspensivos

source: A special kind of blockquote commonly hidden behind a click on SO
es: Un tipo especial de blockquote que se oculta por lo general detrás de un clic en SO

source: Parse ~~strikethrough~~ formatting
es: Análisis del formateado de ~~strikethrough~~

source: Add target="_blank" to all <a> tags with an href. This causes the link to be opened in a new tab upon a click
es: Añadir target="_blank" a todas las etiquetas <a> con un href. Esto hace que el enlace se abrá en una nueva pestaña en un clic

source: Tables using the same format as GFM and PHP-Markdown Extra
es: Tablas utilizando el mismo formato que GFM y PHP-Markdown Extra

source: Requires atx style headers to have a space between the # and the header text. Useful for applications that require twitter style tags to pass through the parser
es: Requiere encabezados de estilo atx para tener un espacio entre el # y el texto contenido en el título. Útil para aplicaciones que requieren el tipo de etiquetas de estilo de twitter para pasar a través del analizador

source: Allows github-style task lists (i.e. check boxes)
es: Permitir tipo de lista de tareas de estilo github (es decir, casillas de verificación)

source: Parse --underline-- formatting
es: Análisis del formateado de --underline--

source: Look for an Emacs-style markdown-extras file variable to turn on Extras
es: Encuentra una variable para el tipo de archivo de estilo Emacs de markdown-extras para habilitar Extras

source: Google Code Wiki table syntax support
es: Apoyo de sintaxis para las tablas de Google Code Wiki

source: Passes one-liner processing instructions and namespaced XML tags
es: Pasar las instrucciones de procesamiento de las etiquetas one-liner y namespaced XML

source: Invalid file path
es: Ruta de archivo inválido

source: Unable to guess the encoding
es: No se ha podido adivinar la codificación.

source: Unable to include “{filePath}”
es: No se ha podido incluir “{filePath}”

source: Just the HTML from your Markdown
es: Justo el HTML desde tu Markdown

source: A minimal template provided by the add-on
es: Una plantilla mínima proporcionada por el complemento

source: Metadata and extra tags error. '%s' value was not recognized for lang field.
es: Error de metadatos y súper etiquetas: la valor '%s' no fue reconocida para el campo lang.

source: Table of contents
es: Índice

source: Markdown to HTML conversion
es: Conversión Markdown hacia HTML

source: Markdown to HTML conversion (preview)
es: Conversión Markdown hacia HTML (vista previa)

source: Markdown to HTML source conversion
es: Conversión Markdown hacia fuente HTML

source: Default &action in interactive mode:
es: &Acción por defecto en modo interactivo:

source: Markdown Engi&ne:
es: M&otor de conversión:

source: Markdo&wn2 extras:
es: Extras Markdo&wn2:

source: &Browse...
es: &Examinar...

source: HTML Templates
es: Plantillas HTML

source: HTML templates &list:
es: &Lista de plantillas HTML:

source: Set as &default template
es: Establecer como plantilla &por defecto

source: &Edit
es: &Editar

source: &Add
es: &Añadir

source: &Remove
es: &Eliminar

source: Are you sure to want to delete the '%s' template?
es: ¿Estás seguro que deseas eliminar la plantilla "%s"?

source: Confirmation
es: Confirmación

source: Add template
es: Añadir una plantilla

source: Edit template
es: Editar una plantilla

source: &Name:
es: &Nombre:

source: &Description:
es: &Descripción:

source: &Content:
es: &Contenido:

source: Wrong value for template name field. Field must contain only letters in lowercase ({letters}), digits ({digits}), hyphen ({hyphen}) or underscore ({underscore}). A maximum of {maxCharTemplateName} characters. The following name is not allowed: "default".
es: Valor incorrecto para el campo de nombre de la plantilla. El campo debe contener sólo letras en minúsculas ({letters}), dígitos ({digits}), guiones ({hyphen}) o guiones bajos ({underscore}). Un máximo de {maxCharTemplateName} caracteres. El siguiente nombre no está permitido: "default".

source: Content field empty.
es: Campo de contenido vacío.

source: Content field invalid. The following required tags are missing: {missingFields}. Each tag must be surrounded by braces. E.g.: {eg}.
es: Campo de contenido inválido. Las siguientes etiquetas están faltantes y obligatorias: {missingFields}. Cada etiqueta debe estar rodeado por llaves. Ej.: {eg}.

source: &Host:
es: &Anfitrión:

source: &Port:
es: &Puerto:

source: Default &encoding:
es: &Codificación por defecto:

source: Root &folders:
es: &Directorios raíz:

source: New version available, version %s. Do you want to download it now?
es: Nueva versión disponible: versión %s. ¿Quieres descargarla ahora?

source: You are up-to-date. %s is the latest version.
es: Estás al día, %s es la versión más reciente.

source: Oops! There was a problem downloading for update. Please retry later or download and install manually via %s. Do you want to open this URL in your browser now?
es: ¡Huy! Hubo un problema al descargar las actualizaciones. Por favor, inténtelo de nuevo más tarde o descargarla e instalarla manualmente vía %s. ¿Quieres abrir esta URL en el navegador ahora?

source: An update check dialog is already running!
es: ¡Una comprobación de las actualizaciones ya está en marcha!

source: {addonName}'s update
es: Actualización de {addonName}

source: Invalid document
es: Documento inválido

source: Full-featured Markdown and HTML converter for NVDA
es: Convertidor Markdown y HTML completo para NVDA
